Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: དེའི་ཕྱིར་ཟད་པ་ཟད་པར་མི་འགྱུར་རོ། །གང་ཟད་པར་མི་འགྱུར་བ་དེ་མི་སྐྱེ་སྟེ།
en: Therefore, exhaustion is not exhausted, and that which is not exhausted does not arise.

source: འདི་ནི་ཟད་པ་དང་མི་སྐྱེ་བ་ཤེས་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: This is known as the truth of knowing exhaustion and nonarising.

source: དེ་ལ་ལམ་ལ་འཇུག་པ་ཤེས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the truth of knowing the entry point to the path?

source: ཡེ་ཤེས་ཀྱི་ལམ་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་བསགས་པ་གང་གིས་ཆོས་ཐམས་ཅད་མ་སྐྱེས་མ་འགགས་པར་ཤེས་པ་དེས་འཇུག་ཅིང་འཛུད་པ་སྟེ།
en: It is entering or being brought onto the path of wisdom, the knowledge that all phenomena are unarising and unceasing by which merit and wisdom are accumulated.

source: དེའི་ཕྱིར་ལམ་ལ་འཇུག་པ་ཤེས་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: For that reason, this is known as the truth of knowing the entry point to the path.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀུན་འབྱུང་བའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the truth of the source of all of the wisdom of the thus-gone-ones?

source: ཆོས་ཀྱི་སྤྲིན་གྱི་ས་དང་། དེ་བཞིན་གཤེགས་པའི་སའི་བར་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀུན་འབྱུང་བའི་བདེན་པ་སྟེ།
en: The truth of the source of all of the wisdom of the thus-gone-ones refers to the Cloud of Dharma bodhisattva level up to the level of a thus-gone one.

source: དེ་བསྟན་པའི་ལམ་གྱིས་མངོན་པར་རྟོགས་པའོ། །
en: It is the realization through the path that teaches that.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པ་བཅུའོ། །
en: “These are the ten truths of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་པ་དག་ལས་དབེན་པ།
en: “What then are the nine successive states of meditative attainment of a bodhisattva?

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: A bodhisattva perfects and then sustains the first dhyāna, which is isolated from sense pleasures, isolated from evil and nonvirtuous factors, involves contemplation and analysis, and includes the experience of joy and bliss born from isolation.

source: དེ་ལ་འདོད་པ་རྣམས་ནི་བསམ་གཏན་དང་པོའི་མི་འཐུན་པའི་ཕྱོགས་ཡིན་ཏེ།
en: “The sense pleasures are anything not conducive to the first dhyāna.

source: གང་སྲེད་པ་དེ་དག་ལས་དབེན་པའོ། །
en: Bodhisattvas are detached from such craving.

source: དེ་ལ་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ནི་ཆགས་པ་དང་། ཞེ་སྡང་དང་གཏི་མུག་སྟེ། གཞི་དེ་ལས་སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་།
en: Evil and nonvirtuous factors are desire, anger, and dullness, as well as what is derived from them: the taking of life, taking what is not given, sexual misconduct, lying, slander, harsh speech, idle chatter, covetousness, ill will, and wrong view.

source: ཚིག་ཀྱལ་པ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བའོ། །འདི་ནི་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་སྟེ།
en: These are called evil and nonvirtuous dharmas.

source: དེ་དག་ལས་དབེན་པ་ནི་བསམ་གཏན་དང་པོའོ། །
en: The first dhyāna is isolated from these.

source: རྟོག་པ་དང་ལྷན་ཅིག་པ་ནི་རྟོག་པ་དང་བཅས་པ་སྟེ།
en: “Involves contemplation means ‘includes contemplation.’

source: རྟོག་པ་དེ་དག་གང་ཞེ་ན།
en: What is contemplated?

source: གང་དག་བསམ་གཏན་དང་པོ་དང་འཐུན་པའི་རྟོག་པ་སྟེ།
en: That which is conducive to the first dhyāna.

source: དེ་ཆོ་ག་བཞིན་དུ་རྟོག་ཅིང་དེ་དག་ཀྱང་དུལ་བས་ན་དེ་དག་ནི་རྟོག་པ་ཞེས་བྱ་སྟེ།
en: They are contemplations because they follow the right method and they bring about the taming of their referents.

source: ཤེས་པ་དང་ཁོང་དུ་ཆུད་པ་དང་། དཔྱོད་པ་དང་། རབ་ཏུ་རྟོག་པ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱེད་པ་ནི་རྟོག་པའོ། །
en: Knowledge, understanding, analysis, investigation, and cultivating samādhi are all types of contemplation.

source: དེ་ལ་དཔྱོད་པ་གང་ཞེ་ན།
en: What is analysis?

source: བསམ་གཏན་དང་པོ་དང་འཐུན་པའི་རྟོག་པ་དེ་དག་ཉིད་ལ་དཔྱོད་པ་དང་། རྣམ་པར་དཔྱོད་པ་དང་། ཉེ་བར་དཔྱོད་པ་དང་། ཀུན་ཏུ་ལོངས་སྤྱོད་པ་དང་།
en: It is the analysis of, inquiry into, exploration of, enjoyment of, cultivation of samādhi on, and aligning the mind with those contemplations that are conducive to the first dhyāna.

source: ཏིང་ངེ་འཛིན་དུ་བྱེད་པ་དང་། སེམས་རྗེས་སུ་འགྲོ་བ་ནི་དཔྱོད་པ་ཞེས་བྱ་སྟེ། དེ་དག་དང་ལྷན་ཅིག་པ་ནི་རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ་བསམ་གཏན་དང་པོའོ། །
en: The first dhyāna involves contemplation and analysis; it includes them.

source: དགའ་བ་དང་བདེ་བ་དབེན་པ་ལས་སྐྱེས་པས་དེའི་ཕྱིར་དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཞེས་བྱའོ། །
en: “Because joy and bliss are born from isolation, it is said that the first dhyāna includes the experience of joy and bliss born from isolation.

source: རྫོགས་པར་བྱས་ཏེ་གནས་ཞེས་བྱ་བ་ལ་རྫོགས་པར་བྱས་ཞེས་བྱ་བ་ནི་སྡོམ་པ་དང་། སྡོམ་པར་བྱེད་པ་དང་སྦེད་པ་དང་། སྦ་བར་བྱེད་པ་དང་།
en: In the phrase ‘perfects and then sustains,’ ‘perfects’ means to be restrained and bring about restraint, to protect and bring about protection, to savor and take delight in.

source: རོ་མྱང་བ་དང་། མངོན་པར་དགའ་བ་སྟེ། བསམ་གཏན་དང་པོ་དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་འདུན་པ་དང་འདོད་པ་འཐོབ་སྟེ།
en: Bodhisattvas who sustain the first dhyāna in this way attain the yearning and desire to understand the acceptance of the nonarising of phenomena.

source: དེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའི་འདུན་པ་དང་འདོད་པ་དེས་བསམ་གཏན་དང་པོ་ལ་སྙིང་པོར་འདུ་ཤེས་པ་ཡིན་ནོ། །
en: Through this yearning and desire to understand acceptance of the nonarising of phenomena, they perceive the very essence of the dhyāna.

source: དེ་བསམ་གཏན་གཉིས་པ་ལ་རྩོམ་སྟེ།
en: “This is the starting point for the second dhyāna.

source: དེ་བསམ་གཏན་དང་པོའི་རྟོག་པ་དང་དཔྱོད་པ་དེ་དག་ཞི་བར་བྱེད། ཉེ་བར་ཞི་བར་བྱེད།
en: Bodhisattvas quiet and bring an end to the contemplation and analysis of the first dhyāna.

source: དེ་དག་ལས་སེམས་རབ་ཏུ་ཞི་བར་བྱེད་ཅིང་བསམ་གཏན་གཉིས་པ་ཡོངས་སུ་འགྲུབ་པའི་རྒྱུ་ཚོལ་ཏེ།
en: They clear their mind of them, then seek the cause for perfecting the second dhyāna.

source: དེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་བས་ནང་ཡོངས་སུ་དང་སྟེ།
en: After doing away with contemplation and analysis, they reach inner clarity.

source: སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ། དགའ་བ་དང་ལྡན་པ་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: Then, with a one-pointed mind devoid of contemplation and analysis, they perfect and sustain the second dhyāna that includes the experience of joy and bliss born from samādhi.

source: དེ་ལ་ནང་ཡོངས་སུ་དང་བ་ནི་དེའི་བསམ་གཏན་གཉིས་པའི་མི་འཐུན་པའི་ཕྱོགས་ཀྱི་ཆོས་གང་ཡིན་པ་དེ་དག་ཉེ་བར་ཞི་བ་དང་དང་བ་ཡིན་ཏེ།
en: “Inner clarity is the ending and clearing away of factors that are not conducive to the second dhyāna.

source: དེའི་ཕྱིར་ནང་ཡོངས་སུ་དང་བ་ཞེས་བྱའོ། །
en: For this reason, it is called inner clarity.

source: རྒྱུད་གཅིག་ཏུ་གྱུར་ཅེས་བྱ་བ་ནི་བསམ་གཏན་དང་པོའི་རྟོག་པ་དང་དཔྱོད་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཞི་ནས་རྒྱ་མཚོའི་ཆུ་ལྟར་རོ་གཅིག་ཏུ་འགྱུར་བ་འཐོབ་པའོ། །འདི་ལྟ་སྟེ།
en: One-pointed indicates that one has achieved a state of one taste, similar to water in the ocean, upon clearing away the contemplation and analysis of the first dhyāna.

source: དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་ཆུ་འབབ་པ་རྣམས་ནི་འདི་ལྟ་སྟེ། ལན་ཚྭའི་རོར་རོ་གཅིག་པར་འགྱུར་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་ཞུགས་པའི་བསམ་གཏན་དང་པོའི་རྟོག་པ་དང་དཔྱོད་པ་དེ་དག་ཐམས་ཅད་ཞི་ནས་རོ་གཅིག་ཏུ་འགྱུར་ཏེ་དེ་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: As an analogy, just as rain that falls in the ocean takes on the same salty flavor, so bodhisattvas achieve the state of one taste upon clearing away all the contemplation and analysis of the first dhyāna while they rest in equipoise in the second dhyāna.

source: ཏིང་ངེ་འཛིན་དེ་ལས་དེ་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་དགའ་བ་སྐྱེ་སྟེ།
en: This is known as samādhi, and from that samādhi such bodhisattvas feel joy in the Buddha, Dharma, and Saṅgha.

source: དེ་དཀོན་མཆོག་གསུམ་ལ་དགའ་བས་དགེ་བའི་ཆོས་རྣམས་རྫོགས་པར་འགྱུར་རོ། །
en: Through this joy in the Three Jewels, they perfect the virtues.

source: དེ་ལས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་འདུན་པ་ཤིན་ཏུ་འབར་བ་དང་། ཤིན་ཏུ་འོད་གསལ་བ་དང་ཤིན་ཏུ་ཡིད་དུ་འོང་བ་འཐོབ་བོ། །
en: Based on that they achieve an intense yearning for the acceptance of the nonarising of phenomena, as well as bright luminosity of mind and a sense of rapture.

source: དེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ལ་འདུན་པ་དེས་བསམ་གཏན་གཉིས་པ་དེ་ལ་མི་ཆགས་ཏེ་བསམ་གཏན་གསུམ་པ་ཀུན་ཏུ་ཚོལ་ལོ། །
en: The yearning for the acceptance of the nonarising of phenomena leads to a lack of attachment to the second dhyāna, which is the starting point for the third dhyāna.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དགའ་བ་ནི་བསམ་གཏན་གསུམ་པའི་སྒྲིབ་པ་ཡིན་ནོ་སྙམ་ནས།
en: “Bodhisattvas think, ‘Joy obscures the third dhyāna.’

source: དེ་དགའ་བ་དེ་ལས་འདོད་ཆགས་དང་བྲལ་ནས་བཏང་སྙོམས་ཅན་དྲན་པ་ཡོངས་སུ་དག་པ།
en: Then, upon being freed from attachment to that joy, they possess equanimity and pure mindfulness.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དགའ་བ་མེད་པ། བདེ་བ་ལ་གནས་པ་ཞེས་བརྗོད་པ་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: They perfect and sustain the third dhyāna, which the noble ones have described as remaining in a state of bliss that is devoid of joy.

source: ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པ་དེ། གང་དེ་དགའ་བ་མེད་པའི་བདེ་བ་དེ་ནི་གཏན་དུ་བདེ་བ་མ་ཡིན་གྱི། ཟད་པའི་ཆོས་ཅན་འཇིག་པའི་ཆོས་ཅན་ཏེ།
en: Bodhisattvas who have attained freedom from attachment to the joy that arises from samādhi come to the conclusion, ‘That bliss that is devoid of joy is not an enduring bliss; rather, it is exhaustible and perishable.

source: དེ་མི་རྟག་ཅིང་མི་བརྟན་ལ་ཐེར་ཟུག་མ་ཡིན་ཞིང་དེ་ཡིད་བརྟན་དུ་མི་རུང་ངོ་སྙམ་པའི་སེམས་དེ་ལྟ་བུ་འཐོབ་བོ། །
en: It is impermanent and unstable, and thus not perpetual. It is unreliable.’

source: དེ་དེ་ལྟར་ཤེས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་འཐོབ་པའི་འདུན་པ་དྲག་པོ་ཆེན་པོ་འཐོབ་བོ། །
en: Upon gaining such an understanding, they acquire a fierce, powerful yearning to attain acceptance of the nonarising of phenomena.

source: དེ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་འདུན་པ་དྲག་པོ་དེས་བདེ་བ་དང་སྡུག་བསྔལ་ལ་མངོན་པར་ཆགས་པ་མི་སྐྱེའོ། །
en: Because of this fierce yearning for unarisen phenomena, they do not experience attachment to happiness or suffering.

source: དེ་བདེ་བ་ཡང་སྤངས་ཏེ་སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་། ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ།
en: “Because they have forsaken happiness and had also previously forsaken suffering, and because they have let go of their elation and despair, they are neither happy nor do they suffer.

source: བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: With pure equanimity and mindfulness, they perfect and sustain the fourth dhyāna.

source: དེ་བས་མ་གཏན་བཞི་པ་ལ་སྙོམས་པར་ཞུགས་པས་མཉེན་པའི་སེམས་སོ། །ཡིད་དུ་འོང་བའི་སེམས་སོ། །ལས་སུ་རུང་བའི་སེམས་སོ། །འོད་གསལ་བའི་སེམས་སོ། །
en: While absorbed in the fourth dhyāna, the bodhisattva’s mind will be supple, pleasing, nimble, bright, and alluring.

source: དྲང་བའི་སེམས་སོ། །བདེ་བ་དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱིར་མངོན་པར་སྨན་ཏོ། །
en: They wish that this bliss would belong to all beings.

source: དེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བ་ལ་མངོན་དུ་ཕྱོགས་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའི་སྣང་བ་སྐྱེའོ། །
en: Because they privilege the benefit and happiness of all beings, bodhisattvas develop clarity about the acceptance of the nonarising of phenomena.

source: དེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའི་སྣང་བ་སྐྱེས་པ་དེས་བསམ་གཏན་བཞི་པ་སྡུག་བསྔལ་ཡང་མ་ཡིན། བདེ་བ་ཡང་མ་ཡིན་པ་མང་བ་དེ་ལ་དགའ་བར་མི་འགྱུར་རོ། །
en: By developing clarity about the acceptance of the nonarising of phenomena, bodhisattvas find no joy in the many things that involve neither happiness nor suffering.

source: གང་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པའི་བདེ་བ་དེ་ལ་ཡང་ཆགས་པར་མི་བྱེད་དོ། །
en: They also do not feel attached to the bliss of pure equanimity and mindfulness.

source: དེ་ལ་མི་ཆགས་པས་དེ་ལ་ནམ་མཁའ་ཉིད་སྣང་བར་འགྱུར་རོ། །
en: Because they are not attached to that, space itself manifests for the bodhisattva.

source: དེ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: Entirely transcending the perceptions of form, all perceptions of obstruction cease and, by not fixating on perceptions of manifoldness, they think, ‘Space is infinite,’ and perfect and sustain the basis of infinite space.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། མདོར་ན་འདི་ལ་གཟུགས་ནི་རྣམ་པ་གཉིས་ཏེ། འབྱུང་བ་དང་འབྱུང་བ་ལས་གྱུར་པའོ། །
en: “They think, ‘In short, there are two types of form: sources and what comes from those sources.

source: དེ་ལ་འབྱུང་བའི་གཟུགས་ནི་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་སོ། །
en: The types of forms that are sources are the elements of earth, water, fire, and air.

source: འབྱུང་བ་ལས་གྱུར་པའི་གཟུགས་ནི་ཁ་དོག་དང་། དྲི་དང་། རོ་དང་། རེག་པ་སྟེ།
en: The forms that come from those sources are colors, smells, tastes, and textures.

source: དེ་ལྟར་གཟུགས་རྣམ་པ་བརྒྱད་དེ།
en: Thus we arrive at eight types of form.

source: གཟུགས་དེ་དག་གི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ནས། ཐོགས་པའི་འདུ་ཤེས་མི་འབྱུང་སྟེ་ནུབ་པར་འགྱུར་རོ། །
en: After transcending perceptions of those kinds of forms, obstructing perceptions will not arise, and will decrease.

source: གང་ན་གཟུགས་སུ་འདུ་ཤེས་པ་དེ་ན་ཐོགས་པར་འདུ་ཤེས་པ་སྟེ། དེ་བས་ན་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ནས་ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་འགྱུར་རོ། །
en: Anytime there is a perception of form it is a perception of obstruction, and so perceptions of obstruction decrease when the perceptions of form are transcended.

source: ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་ན་སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་བྱེད་པ་མི་འཇུག་གོ། །
en: When perceptions of obstruction decrease, one no longer fixates on perceptions of manifoldness.

source: སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་དུ་འཇུག་གོ། །
en: And, by not fixating on perceptions of manifoldness, space is infinite.’

source: དེ་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: Thinking, ‘Space is infinite,’ bodhisattvas perfect and sustain the basis of infinite space.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་ཞུགས་པ་འདི་སྙམ་དུ་སེམས་ཏེ། ནམ་མཁའ་ནི་མཐའ་མེད་པས་མཐའ་ཡས་སོ། །
en: “Bodhisattvas who have reached the meditative attainment of the basis of infinite space think, ‘Space is infinite because it lacks a limit.

source: གང་ལ་མཐའ་མེད་པ་དེའི་ཐོག་མ་ཡོད་པར་ག་ལ་འགྱུར།
en: Where would the beginning be for something that has no limit?

source: དབུས་ཡོད་པར་ག་ལ་འགྱུར་ཏེ།
en: Where would a middle be?

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ནི་ཐོག་མ་དང་ཐ་མ་དང་དབུས་མེད་དོ་སྙམ་མོ། །
en: In the same way, all phenomena are without beginning, end, or middle.’

source: དེ་ལྟར་སྙོམས་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ལ་ནི་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད། ཆོས་རྣམས་ལ་ནི་ནམ་མཁའ་དང་མཚུངས་པ་ཉིད་ཀྱི་ཤེས་པ་འཇུག་སྟེ།
en: Bodhisattvas who have reached such a meditative attainment will develop strong compassion for all beings and will act with the understanding that all phenomena are precisely equivalent to space.

source: དེ་ནི་དོན་དེའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རྩོམ་པའོ། །
en: This is the starting point for acceptance of the nonarising of phenomena.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Such bodhisattvas transcend the basis of infinite space in all its aspects; think, ‘Consciousness is infinite’; and then perfect and sustain the basis for infinite consciousness.

source: གང་ནམ་མཁའ་འདུ་ཤེས་པ་འདི་ནི་རྣམ་པར་ཤེས་པར་འགྱུར་བའོ་སྙམ་ནས་དེ་འདི་སྙམ་དུ་འདི་ཐམས་ཅད་ནི་རྣམ་པར་ཤེས་པ་ཙམ་སྟེ། རྣམ་ཤེས་མཐའ་ཡས་དེ་ཡང་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །
en: “Bodhisattvas first think, ‘The perception of space is consciousness,’ and then think, ‘Everything is consciousness alone, and that infinite consciousness neither exists nor does not exist.’

source: དེ་དེ་ལྟར་སྙོམས་པར་ཞུགས་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཡིན་ཏེ་ཡོངས་སུ་གྲུབ་པ་ནི་མ་ཡིན་ནོ། །
en: They attain acceptance of the nonarising of phenomena through this meditative attainment, but it is not fully realized.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: They transcend the basis of infinite consciousness in all its aspects; think, ‘There is nothing at all’; and then perfect and sustain the basis for there being nothing at all.

source: ཅི་ཡང་མེད་ཅེས་བྱ་བ་ལ་ཅི་ཡང་ཞེས་བྱ་བ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། རྟོག་པ་དང་།
en: “In the phrase ‘nothing at all’ the ‘things’ include desire, hatred, dullness, thoughts, concepts, assumptions, and conceptual constructs, as well as all that arises from false ideas.

source: རྣམ་པར་རྟོག་པ་དང་།
en: Thus, there is ‘nothing at all.’

source: ཡོངས་སུ་རྟོག་པ་དང་། འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་ཏུ་རྟོག་པ་ལས་བྱུང་བ་རྣམས་ནི་ཅི་ཡང་མེད་ཅེས་བྱའོ། །ཅི་ཡང་མེད་པ་ནི་ཇི་སྐད་དུ་བརྗོད་པ་དེ་དག་ལས་ཆུང་ངུར་གྱུར་ཕྲ་བར་གྱུར་པ་ནི་ཅི་ཡང་མེད་པ་ཞེས་བྱའོ། །
en: From among those phenomena described as ‘nothing at all,’ that which is further attenuated and increasingly subtle is nothing at all.

source: དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཤིན་ཏུ་འབར་བ། ཤིན་ཏུ་འོད་གསལ་བ་ཡིན་ནོ། །
en: This indicates that the acceptance of the nonarising of phenomena on the part of bodhisattvas who sustain the attainment of nothing at all is bright and blazing.

source: དེ་རྒྱུ་དེ་དང་རྐྱེན་དེ་དང་། གཞི་དེ་དང་ཐོབ་པ་དེའི་ཕྱིར་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལ་མི་ཆགས་ཏེ།
en: They are not attached to the basis of nothing at all because of its causes, its conditions, its foundation, and its attainment.

source: དེ་གོང་དུ་རྩོལ་ལོ། །དེ་གོང་དུ་རྩོལ་བ་ན་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ནི་གང་འདུ་བྱེད་རྣམས་ཀྱི་ཕྲ་བ་ལ་ཅི་ཡང་མེད་པར་ཡོངས་སུ་བརྟགས་པ་སྟེ།
en: They move beyond that, thinking as they do, ‘Subtle karmic formations have been determined to be nothing at all.

source: དེ་ནི་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་པ་ཡང་མ་ཡིན་ནོ་སྙམ་མོ། །
en: That perception neither exists nor does not exist.’

source: དེ་ལ་འདུ་ཤེས་མེད་པ་ནི་སྟོང་པའི་ཕྱིར་རོ། །
en: The perception does not exist because it is empty.

source: འདུ་ཤེས་མེད་པ་ཡང་མ་ཡིན་པ་ནི་རྟེན་ཅིང་འབྲེལ་པར་བྱུང་བའི་ཕྱིར་རོ། །དེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་མངོན་དུ་འགྱུར་ཏེ།
en: The perception is not something nonexistent because it arises dependently.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: Such bodhisattvas actualize the basis of perception that neither exists nor does not exist, transcend the basis of nothing at all in all its aspects, and then perfect and sustain the basis of perception that neither exists nor does not exist.

source: དེ་དེ་ལ་གནས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ལ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་དེ་ལ་དགའ་བ་ཅི་ཞིག་ཡོད་སྙམ་ནས་དེ་བློ་དེ་ལས་གོང་དུ་བསྐྱོད་དོ། །
en: “Bodhisattvas who sustain this think, ‘What manner of joy is there when perception neither exists nor does not exist?’

source: དེ་བློ་དེ་ལས་གོང་དུ་བསྐྱོད་ནས་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་ཆོས་མངོན་དུ་འགྱུར་ཏེ།
en: They then elevate their thinking beyond this, and in doing so actualize the fact that there is no arising and no ceasing.

source: དེ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། མ་འགགས་པར་མཐོང་ངོ་། །
en: They see that all phenomena do not arise and do not cease.

source: དེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་འགགས་པར་མཐོང་ནས་ཡང་མི་འཇུག་མི་ལྡོག་གོ། །
en: Seeing that all phenomena do not cease by their very nature, they neither accept nor reject them.

source: དེ་དེའི་ཕྱིར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: It is on account of this that bodhisattvas have the pure acceptance of the nonarising of phenomena.

source: དེ་དེ་ལས་གོང་དུ་ལྷུན་གྱིས་གྲུབ་པ་རྒྱུན་མི་འཆད་པར་འཇུག་སྟེ།
en: From this point such bodhisattvas unceasingly and effortlessly proceed higher.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའོ། །
en: “These are the nine successive states of meditative attainment of bodhisattvas.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མོས་པའི་སྟོབས་དང་། སོ་སོར་རྟོག་པའི་སྟོབས་དང་།
en: “What are the bodhisattva’s ten strengths?

source: བསྒོམ་པའི་སྟོབས་དང་། བཟོད་པའི་སྟོབས་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སྤོང་བའི་སྟོབས་དང་། ཐོས་པའི་སྟོབས་དང་།
en: The strength of conviction, the strength of discernment, the strength of cultivation, the strength of patience, the strength of wisdom, the strength of abandonment, the strength of learning, the strength of confident eloquence, the strength of merit, and the strength of practice.

source: སྤོབས་པའི་སྟོབས་དང་། བསོད་ནམས་ཀྱི་སྟོབས་དང་། སྒྲུབ་པའི་སྟོབས་སོ། །དེ་ལ་མོས་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is the strength of conviction?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་དང་གང་མོས་པ་དེའི་དེ་དེ་བཞིན་དུ་འགྱུར་རོ། །
en: It entails that everything the bodhisattva has conviction in is how things turn out to be.

source: དེའི་མོས་པའི་སྟོབས་དེ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཟིལ་གྱིས་གནོན་མི་ནུས་ཏེ།
en: The strength of conviction is such that the world with its gods cannot overcome it.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་མོས་པའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of conviction.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་རྟོག་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of discernment?

source: གང་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་ཆགས་སྐྱེས་པ་མི་སྡུག་པ་བསྒོམས་པས་ཞི་བར་བྱེད་དོ། །
en: Bodhisattvas quell the arising of attachment by cultivating a sense of unpleasantness.

source: ཞེ་སྡང་སྐྱེས་པ་བྱམས་པ་བསྒོམས་པས་ཞི་བར་བྱེད་དོ། །
en: They quell the arising of anger by cultivating love.

source: གཏི་མུག་སྐྱེས་པ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བསྒོམས་པས་ཞི་བར་བྱེད་དོ། །
en: They quell the arising of dullness by cultivating an understanding of dependent arising.

source: གཤེ་བ་དང་མི་སྙན་པར་ཟེར་བ་རྣམས་ནི་བྲག་ཅ་དང་མཚུངས་པར་ཤེས་པ་ཡོངས་སུ་ཤེས་པས་ཞི་བར་བྱེད་དོ། །
en: They quell belligerent and unkind statements by reflecting on the knowledge that they are like echoes.

source: གསོད་པ་དང་འཆིང་བ་དང་། གོ་རར་འཇུག་པ་རྣམས་ནི་ལས་བདག་གིར་བྱ་བ་ཤེས་པས་ཞི་བར་བྱེད་དོ། །
en: They quell killing, bondage, and imprisonment through the knowledge that they are the result of one’s own karma.

source: ལུས་ལ་བསྡིགས་པ་དང་ལུས་ལ་གནོད་པ་དང་ལུས་ལ་ཉམ་ང་བ་རྣམས་ནི་གཟུགས་བརྙན་དང་མཚུངས་པར་ཤེས་པས་ཞི་བར་བྱེད་དོ། །
en: They quell physical threats, physical harms, and physical hardship through the knowledge that they are like reflected images.

source: དེ་ལྟར་ཀུན་ནས་ཉོན་མོངས་པའི་སྒོ་ཇི་སྙེད་པར་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དག་པའི་སྒོ་ཡང་དེ་སྙེད་དུ་མཐོང་སྟེ།
en: In this way, they see a gateway to a bodhisattva’s purification wherever they see a gateway to defilement.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་རྟོག་པའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of discernment.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བསྒོམ་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of cultivation?

source: གང་མོས་པས་སྤྱོད་པའི་ས་དང་། མཐོང་བའི་ས་ལ་བར་དུ་གཅོད་པར་བྱེད་པའི་ཆོས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་བར་ཆད་བྱེད་མི་ནུས་སོ། །
en: Phenomena that are disruptive to the level of dedicated conduct and the level of seeing have no capacity to affect the bodhisattva.

source: དེས་མཐོང་བ་དེ་དང་ལམ་དེ་ལས་ལྷར་བཅས་པའི་འཇིག་རྟེན་གྱིས་དབྲལ་བར་མི་ནུས་ཏེ།
en: Because of that, the world with its gods do not have the capacity to separate the bodhisattva from that seeing, from that path.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསྒོམ་པའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of cultivation.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of patience?

source: གང་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྤྱོས་ཀྱང་བྲག་ཅའི་སྒྲ་དང་མཚུངས་པར་ཤེས་པའི་སྟོབས་ཀྱིས་སླར་སྤྱོ་བར་མི་བྱེད་དོ། །
en: When mocked, bodhisattvas do not respond with mockery due to the force of their understanding that it is the same as the sound of an echo.
